/* 特殊现场设置配置 */
let config = {
    company:0, /*  0:中自庆安，1:金风现场 */
    intelligentNav: true, /*  智子设置模块 true:显示，false:隐藏 */
}

//机泵类型列表
const PUMP_TYPE_SOURCE = {
    '1':'辊压机',
    '2':'管磨（边缘直驱）',
    '3':'管磨（边缘传动）',
    '4':'水泥磨（中心传动）',
    '5':'水泥磨（行星轮传动）',
    '6':'回转窑（单驱）',
    '7':'回转窑（双驱）',
    '8':'煤立磨',
    '9':'生料立磨',
    '10':'熟料链斗机',
    '11':'提升机（单驱）',
    '12':'提升机（双驱）',
    '13':'余热发电',
    '14':'排风机',
    '15':'轴流风机',
    '16':'罗茨风机',
    '17':'破碎机-单驱',
    '18':'破碎机-双驱双转子',
    '19':'选粉机',
    '20':'循环水泵',
    '21':'空压机',
    '22':'混黏土搅拌机',
    '23':'皮带机（双驱）',
    '24':'皮带机（单驱）',
    '25':'煤矿天轮'
};

/* 采集器配置 */

/*
硬件滤波下拉选项
dgmType:采集器类型
1:振动采集器DGU2000V1
2.叶轮采集器DGU2200
3.振动采集器DGU2000V2
4.MHD采集器
5.螺栓采集器
6.E821
7.TMS2000采集器
8.WHD
9.DGU2000E
10.WL9100
11.DS8000
12.DS7000
 */

